Autodesk.Revit.DB.ExportPatternKey.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportPatternKey.OriginalFillPatternName
The original FillPattern name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportPatternKey.OriginalFillPatternType
The original FillPattern type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.ExportPatternKey.#ctor(Autodesk.Revit.DB.FillPatternTarget,System.String)
Constructs a new ExportPatternKey using the original fill pattern type and name as input.
originalFillPatternType:
The original FillPattern type.
originalFillPatternName:
The original FillPattern name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.ExportPatternKey.#ctor
Constructs a new default ExportPatternKey.
Since:
2014

Autodesk.Revit.DB.ExportPatternKey.#ctor(Autodesk.Revit.DB.ExportPatternKey)
Constructs a new copy of the input ExportPatternKey object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportPatternKey
A key used to represent an item stored in an Autodesk.Revit.DB.ExportPatternTable.
Since:
2014